* KrakenOS
** Example
#+BEGIN_SRC jupyter-python
"""Examp Doublet Lens Pupil"""

# Loading the library
import KrakenOS as Kos
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jupyter-python  
# Creating an object of the surf class for the object plane
P_Obj = Kos.surf()
P_Obj.Thickness = 100
P_Obj.Glass = "AIR"
P_Obj.Diameter = 30.0

# Creating a surface for the first face in BK7 Glass
L1a = Kos.surf()
L1a.Rc = 92.847
L1a.Thickness = 6.0
L1a.Glass = "BK7"
L1a.Diameter = 30.0

# Creating a surface for the second face in F2 Glass
L1b = Kos.surf()
L1b.Rc = -30.716
L1b.Thickness = 3.0
L1b.Glass = "F2"
L1b.Diameter = 30

# Creating a surface for the third interface to air
L1c = Kos.surf()
L1c.Rc = -78.197
L1c.Thickness = 97.376 - 40
L1c.Glass = "AIR"
L1c.Diameter = 30

# Creating a surface to exemplify a pupil
pupila = Kos.surf()
pupila.Rc = 30
pupila.Thickness = 40.
pupila.Glass = "AIR"
pupila.Diameter = 5
pupila.Name = "Pupil"
pupila.DespY = 0.
pupila.Nm_Poss=[-10,10]

# Creating a surface for image plane
P_Ima = Kos.surf()
P_Ima.Rc = 0.0
P_Ima.Thickness = 0.0
P_Ima.Glass = "AIR"
P_Ima.Diameter = 20.0
P_Ima.Name = "P_Ima"
P_Ima.Nm_Poss=[-10,10]
#+END_SRC

#+RESULTS:


#+BEGIN_SRC jupyter-python  
A = [P_Obj, L1a, L1b, L1c, pupila, P_Ima]
config_1 = Kos.Setup()
#+END_SRC

#+RESULTS:
: Default catalog is loaded from:  /home/thinky/.virtualenvs/tf/lib/python3.11/site-packages/KrakenOS/Cat/
: Glass catalog loaded
: Loading glass calatogs:


#+BEGIN_SRC jupyter-python  
# Creating the system with previus information
Doublet = Kos.system(A, config_1)
#+END_SRC

#+RESULTS:


#+BEGIN_SRC jupyter-python  
Rays = Kos.raykeeper(Doublet)
#+END_SRC

#+RESULTS:


#+BEGIN_SRC jupyter-python  
W = 0.4
sur = 4
AperVal = 10
AperType = "EPD"
Pup = Kos.PupilCalc(Doublet, sur, W, AperType, AperVal)

# Configuring field and ray array type
Pup.Samp = 3
Pup.Ptype = "fan"
Pup.FieldType = "angle"
Pup.FieldY = 2.0
#+END_SRC

#+RESULTS:


#+BEGIN_SRC jupyter-python  

# ray origin coordinates and direction cosines
x, y, z, L, M, N = Pup.Pattern2Field()

# Tracing the rays with a loop
for i in range(0, len(x)):
    pSource_0 = [x[i], y[i], z[i]]
    dCos = [L[i], M[i], N[i]]
    Doublet.Trace(pSource_0, dCos, W)
    Rays.push()# Saving rays

# Configuring (-field) and ray array type,.. etc
Pup.FieldY = -Pup.FieldY
x, y, z, L, M, N = Pup.Pattern2Field()
for i in range(0, len(x)):
    pSource_0 = [x[i], y[i], z[i]]
    dCos = [L[i], M[i], N[i]]
    Doublet.Trace(pSource_0, dCos, W)
    Rays.push() # Saving rays
#+END_SRC

#+RESULTS:


#+BEGIN_SRC jupyter-python  
Kos.display3d(Doublet, Rays,2)
#+END_SRC

#+RESULTS:
: /home/thinky/.virtualenvs/tf/lib/python3.11/site-packages/pyvista/plotting/plotter.py:6990: UserWarning: `auto_close` ignored: by clicking the exit button, you have destroyed the render window and we have to close it out.
:   warnings.warn(


#+BEGIN_SRC jupyter-python  
Kos.display2d(Doublet, Rays,0,1)
#+END_SRC

** Chapter 1
#+BEGIN_SRC jupyter-python  
import KrakenOS as Kos

P_Obj = Kos.surf()
P_Obj.Thickness = 10
P_Obj.Diameter = 30.0

F1 = Kos.surf()
F1.Rc = 50
F1.Glass = “AIR”
F1.Thickness = 70.0
F1.Diameter = 30

P_Ima = Kos.surf()
P_Ima.Thickness = 0.0
P_Ima.Diameter = 30.0
P_Ima.Name = “Image plane”
P_Ima.Nm_Poss = (−10, 10)

config_1 = Kos.Setup()

A = [P_Obj, F1, P_Ima]
Lens = Kos.system(A, config_1)

#Rays = Kos.raykeeper (Lens)
# Presented in future section
#Kos.display3d (Lens, Rays, 0) # Presented in future section
#+END_SRC

